app/Livewire/Calendar.php

    public function getEventsBetweenDate($startDate, $endDate)
    {
        $start = Carbon::parse($startDate);
        $end = Carbon::parse($endDate);

        $this->calendarEvents = auth()->user()->eventsBetweenDate($start, $end)
            ->get()
            ->map(function($event) {
                return [
                    'id' => $event->id,
                    'title' => $event->title,
                    'start' => Carbon::parse($event->start)->toIso8601String(),
                    'end' => $event->end ? Carbon::parse($event->end)->toIso8601String() : null,
                ];
            })->toArray();
---
select * from `events` where `events`.`user_id` = 1 and `events`.`user_id` is not null and `start` between '2025-03-01 00:00:00' and '2025-03-31 23:59:59'